andrewleech/micropython/ports/stm32/mpzephyrport.c
            if (h4_payload_remaining == 0) {
                // Payload complete, packet is ready
                h4_state = H4_STATE_TYPE;
                return true;
            }
            return false;
    }

    return false;
}

// Callback for mp_bluetooth_hci_uart_readpacket() - called for each byte
// IMPORTANT: This may be called from interrupt context (IPCC IRQ on STM32WB)
// DO NOT call recv_cb() directly - queue the buffer for processing in scheduler context
static void h4_uart_byte_callback(uint8_t byte) {
    if (h4_parser_process_byte(byte)) {
        if (h4_buf) {
            struct net_buf *buf = h4_buf;
            h4_buf = NULL;  // Ownership transferred

            #if ZEPHYR_BLE_DEBUG
            // Debug: Trace HCI packets (type is first byte in buffer)
            uint8_t pkt_type = buf->data[0];
            if (pkt_type == H4_ACL) {
                // ACL data packet - decode handle and L2CAP/ATT info
                uint16_t handle = (buf->data[1] | (buf->data[2] << 8)) & 0x0FFF;
                uint16_t acl_len = buf->data[3] | (buf->data[4] << 8);
                DEBUG_HCI_printf("RX ACL: handle=0x%03x len=%d, first_byte=0x%02x\n",
                    handle, acl_len, (buf->len > 9) ? buf->data[9] : 0);
            } else if (pkt_type == H4_EVT) {
                // HCI Event - decode event code
                uint8_t evt_code = buf->data[1];
                if (evt_code == HCI_EVT_DISCONNECT_COMPLETE) {
                    // Disconnect Complete: [type=04][evt=05][len=4][status][handle_lo][handle_hi][reason]
                    uint8_t status = buf->data[3];
                    uint16_t handle = (buf->data[4] | (buf->data[5] << 8)) & 0x0FFF;
                    uint8_t reason = buf->data[6];
                    DEBUG_HCI_printf("RX DISCONNECT: handle=0x%03x status=%d reason=0x%02x\n",
                        handle, status, reason);
                } else if (evt_code == HCI_EVT_CMD_COMPLETE) {
                    uint16_t opcode = buf->data[4] | (buf->data[5] << 8);
                    DEBUG_HCI_printf("RX CMD_COMPLETE: opcode=0x%04x\n", opcode);
                }
            }
            #endif

            // Queue the buffer for processing in scheduler context
            // This avoids calling bt_hci_recv() from interrupt context
            if (!rx_queue_put(buf)) {
                error_printf("RX queue full\n");
                net_buf_unref(buf);
            } else {
                // Schedule task to process queued packets
                // This is safe from IRQ context (same as NimBLE UART IRQ)
                mp_zephyr_hci_poll_now();
            }
        }
    }
}

// This is called by soft_timer and executes at PendSV/scheduler level
static void mp_zephyr_hci_soft_timer_callback(soft_timer_entry_t *self) {
    #if ZEPHYR_BLE_DEBUG
    static int timer_fire_count = 0;
    timer_fire_count++;

    if (timer_fire_count <= 5) {
        DEBUG_HCI_printf("[TIMER FIRE #%d]\n", timer_fire_count);
    }
    #endif

    // CRITICAL: Reschedule the timer IMMEDIATELY before scheduling the task
    // This ensures the timer is always active for the next cycle
    soft_timer_reinsert(&mp_zephyr_hci_soft_timer, 128);

    #if ZEPHYR_BLE_DEBUG
    if (timer_fire_count <= 5) {
        DEBUG_HCI_printf("[TIMER FIRE #%d] Rescheduled for 128ms\n", timer_fire_count);
    }
    #endif

    mp_zephyr_hci_poll_now();
}

// HCI packet reception handler - called when data arrives
static void run_zephyr_hci_task(mp_sched_node_t *node) {
    (void)node;

    // Guard: IPCC IRQ can fire after deinit, scheduling this function via
    // mp_bluetooth_hci_poll_now(). Check if H:4 recv callback is still registered
    // — it's set during hci_stm32_open() and cleared during hci_stm32_close().
    // This allows processing during init (callback set) but blocks post-deinit
    // (callback cleared by bt_disable → hci_stm32_close).
    if (mp_bluetooth_zephyr_h4_get_recv_cb() == NULL) {
        DEBUG_HCI_printf("port_run_task: GUARD BLOCKED (h4_recv_cb=NULL)\n");
        return;
    }

    // Process Zephyr BLE work queues and semaphores
    mp_bluetooth_zephyr_poll();

    if (recv_cb == NULL) {
        return;
    }

    // Process any queued RX buffers (from interrupt context)
    // STM32WB55 IPCC Fix: Batch collect and sort events to ensure CONNECTION_COMPLETE
    // is processed before DISCONNECT_COMPLETE when both arrive in same transaction.
    #define HCI_EVENT_BATCH_SIZE 16
    struct net_buf *batch[HCI_EVENT_BATCH_SIZE];
    int batch_count = 0;

    // Phase 1: Collect all queued events into batch
    struct net_buf *buf;
    while (batch_count < HCI_EVENT_BATCH_SIZE && (buf = rx_queue_get()) != NULL) {
        batch[batch_count++] = buf;
    }

    // Phase 2: Sort batch by priority (connection events before disconnect)
    if (batch_count > 1) {
        hci_event_sort_batch(batch, batch_count);
    }

    // Phase 3: Process sorted batch
    for (int i = 0; i < batch_count; i++) {
        buf = batch[i];
        int ret = recv_cb(hci_dev, buf);
        if (ret < 0) {
            error_printf("recv_cb failed: %d\n", ret);
            net_buf_unref(buf);
        }
    }

    // Phase 4: Process work queue to trigger rx_work (connection callbacks etc)
    // Only the outermost call (depth==0) should process work to prevent re-entrancy.
    // Nested calls via k_sem_take→hci_uart_wfi→run_zephyr_hci_task skip work processing.
    extern volatile int mp_bluetooth_zephyr_hci_processing_depth;
    if (batch_count > 0 && mp_bluetooth_zephyr_hci_processing_depth == 0) {
        mp_bluetooth_zephyr_hci_processing_depth++;
        mp_bluetooth_zephyr_work_process();
        mp_bluetooth_zephyr_hci_processing_depth--;
    }

    // Check buffer availability before reading from IPCC.
    // If no buffers available, process work queue to free some.
    // This prevents silent packet drops when buffer pool is exhausted (Issue #12).
    if (!mp_bluetooth_zephyr_buffers_available()) {
        mp_bluetooth_zephyr_work_process();
        if (!mp_bluetooth_zephyr_buffers_available()) {
            // Still no buffers - skip reading, will retry on next poll
            mp_bluetooth_zephyr_port_poll_in_ms(10);
            return;
        }
    }

    // Read HCI packets using port's transport abstraction
    // This works for both UART and IPCC (STM32WB)
    // Note: On STM32WB, this is called from IPCC interrupt so packets
    // are queued rather than processed immediately
    while (mp_bluetooth_hci_uart_readpacket(h4_uart_byte_callback) > 0) {
        // Keep reading while packets are available
        // Re-check buffer availability after each packet to prevent exhaustion
        if (!mp_bluetooth_zephyr_buffers_available()) {
            mp_bluetooth_zephyr_work_process();
            if (!mp_bluetooth_zephyr_buffers_available()) {
                // No buffers - stop reading, will retry on next poll
                mp_bluetooth_zephyr_port_poll_in_ms(10);
                break;
            }
        }
    }
}

