andrewleech/micropython/ports/stm32/mpzephyrport.c
// Device state (must be persistent and zero-initialized)
static struct device_state hci_device_state = {
    .init_res = 0,       // Success
    .initialized = true, // Mark as initialized
};

// HCI device structure (referenced by Zephyr via DEVICE_DT_GET macro)
// Define with the name that DEVICE_DT_GET expects: __device_dts_ord_0
// This is what DEVICE_DT_GET(0) expands to when DT_CHOSEN returns 0
// Use externally_visible to prevent linker garbage collection
__attribute__((used, externally_visible))
const struct device __device_dts_ord_0 = {
    .name = "HCI_STM32",
    .config = NULL,              // No config needed
    .api = &hci_stm32_api,
    .state = &hci_device_state,  // Required for device_is_ready()
    .data = NULL,
    .ops = {.init = NULL},       // No init function needed
    .flags = 0,                  // No special flags
};

// Provide accessible name for port code
__attribute__((used, externally_visible))
const struct device *const mp_bluetooth_zephyr_hci_dev = &__device_dts_ord_0;


// HCI transport setup (called by BLE host during initialization)
// Use __attribute__((used)) to prevent linker garbage collection
__attribute__((used))
int bt_hci_transport_setup(const struct device *dev) {
    (void)dev;

    #if defined(STM32WB)
    // STM32WB: IPCC transport, no external controller
    // rfcore_ble_init() is called by mp_bluetooth_hci_uart_init()
    //
    // Re-enable IPCC NVIC IRQ — disabled by bt_hci_transport_teardown() on previous
    // deinit cycle. rfcore_init() / ipcc_init() only runs once at boot from main.c,
    // not on subsequent bt_enable() cycles, so we must re-enable here explicitly.
    NVIC_EnableIRQ(IPCC_C1_RX_IRQn);
    return mp_bluetooth_hci_uart_init(MICROPY_HW_BLE_UART_ID, MICROPY_HW_BLE_UART_BAUDRATE);

    #else
    // Other STM32: UART transport with external controller
    // Initialize external BLE controller
    int ret = mp_bluetooth_hci_controller_init();
    if (ret != 0) {
        error_printf("Controller init failed: %d\n", ret);
        return ret;
    }

    // Initialize UART HCI transport
    return mp_bluetooth_hci_uart_init(MICROPY_HW_BLE_UART_ID, MICROPY_HW_BLE_UART_BAUDRATE);
    #endif
}

// HCI transport teardown
__attribute__((used))
int bt_hci_transport_teardown(const struct device *dev) {
    (void)dev;
    DEBUG_HCI_printf("bt_hci_transport_teardown\n");

    #if defined(STM32WB)
    // Disable IPCC to prevent post-teardown callbacks from RF coprocessor.
    // CPU2 can send unsolicited events after HCI_Reset which would trigger
    // IPCC_C1_RX_IRQHandler → mp_bluetooth_hci_poll_now() into freed state.
    // Re-enabled in bt_hci_transport_setup() on next bt_enable().
    NVIC_DisableIRQ(IPCC_C1_RX_IRQn);
    NVIC_ClearPendingIRQ(IPCC_C1_RX_IRQn);
    // Barrier + delay to ensure in-flight IPCC handler completes
    __DSB();
    __ISB();
    #else
    mp_bluetooth_hci_controller_deinit();
    #endif

    return mp_bluetooth_hci_uart_deinit();
}

// Main polling function (called by mpbthciport.c via mp_bluetooth_hci_poll)
void mp_bluetooth_hci_poll(void) {
    if (!mp_bluetooth_is_active()) {
        DEBUG_HCI_printf("mp_bluetooth_hci_poll: NOT ACTIVE, skipping\n");
        return;
    }

    // Call mp_bluetooth_zephyr_port_run_task directly to process HCI events
    // This includes: mp_bluetooth_zephyr_poll(), RX queue processing,
    // work queue processing, and reading HCI packets from transport
    run_zephyr_hci_task(NULL);

    // Schedule next poll if stack is active
    mp_bluetooth_zephyr_port_poll_in_ms(128);
}

// Initialize Zephyr port (called early in initialization)
void mp_bluetooth_zephyr_port_init(void) {
    DEBUG_HCI_printf("[INIT] mp_bluetooth_zephyr_port_init CALLED\n");

    // Force linker to keep __device_dts_ord_0 by referencing it
    // This prevents garbage collection with --gc-sections
    // Use volatile to prevent compiler from optimizing away the reference
    extern const struct device __device_dts_ord_0;
    volatile const void *keep_device = &__device_dts_ord_0;
    (void)keep_device;

    DEBUG_HCI_printf("[INIT] Calling soft_timer_static_init...\n");
    soft_timer_static_init(
        &mp_zephyr_hci_soft_timer,
        SOFT_TIMER_MODE_ONE_SHOT,
        0,
        mp_zephyr_hci_soft_timer_callback
        );
    DEBUG_HCI_printf("[INIT] soft_timer_static_init completed\n");

    #if defined(STM32WB)
    // Re-enable IPCC IRQ — disabled during deinit (mp_bluetooth_zephyr_port_deinit).
    // In SUSPENDED mode, bt_hci_transport_setup() is not called on re-init, so
    // this is the only place the IRQ gets re-enabled for subsequent BLE cycles.
    // On first boot this is a harmless no-op (IRQ is already enabled from ipcc_init).
    NVIC_EnableIRQ(IPCC_C1_RX_IRQn);
    #endif
}

// Schedule HCI poll in N milliseconds
void mp_bluetooth_zephyr_port_poll_in_ms(uint32_t ms) {
    #if ZEPHYR_BLE_DEBUG
    static int resched_count = 0;
    resched_count++;

    if (resched_count <= 5) {
        DEBUG_HCI_printf("[RESCHEDULE #%d for %ums]\n", resched_count, (unsigned)ms);
    }
    #endif

    soft_timer_reinsert(&mp_zephyr_hci_soft_timer, ms);
}

// Debug wrapper for hci_core.c to print device info
// This avoids including MicroPython headers in Zephyr source files
void mp_bluetooth_zephyr_debug_device(const struct device *dev) {
    #if ZEPHYR_BLE_DEBUG
    DEBUG_HCI_printf("[DEBUG hci_core.c] bt_dev.hci = %p\n", dev);
    if (dev) {
        DEBUG_HCI_printf("[DEBUG hci_core.c]   name = %s\n", dev->name);
        DEBUG_HCI_printf("[DEBUG hci_core.c]   state = %p\n", dev->state);
        if (dev->state) {
            DEBUG_HCI_printf("[DEBUG hci_core.c]     initialized = %d\n", dev->state->initialized);
            DEBUG_HCI_printf("[DEBUG hci_core.c]     init_res = %d\n", dev->state->init_res);
        }
    }
    #else
    (void)dev;
    #endif
}

// HCI RX task stubs for non-FreeRTOS builds
// STM32 uses polling-based HCI reception, not a dedicated task
void mp_bluetooth_zephyr_hci_rx_task_start(void) {
    // No-op: STM32 uses IPCC interrupts and soft timer polling
}

void mp_bluetooth_zephyr_hci_rx_task_stop(void) {
    // No-op
}

bool mp_bluetooth_zephyr_hci_rx_task_active(void) {
    return false;  // Always use polling mode on STM32
}

// Non-inline version of mp_bluetooth_hci_poll_now for extmod code.
// modbluetooth_zephyr.c uses extern declaration, so we need a linkable symbol.
void mp_bluetooth_hci_poll_now(void) {
    mp_bluetooth_hci_poll_now_default();
}

// Port deinit - called during mp_bluetooth_deinit()
void mp_bluetooth_zephyr_port_deinit(void) {
    #if defined(STM32WB)
    // Disable IPCC IRQ FIRST to prevent post-deinit callbacks from CPU2.
    // In SUSPENDED mode bt_hci_transport_teardown() is not called, so this
    // is the only place the IRQ gets disabled. Re-enabled in
    // bt_hci_transport_setup() on next init.
    NVIC_DisableIRQ(IPCC_C1_RX_IRQn);
    NVIC_ClearPendingIRQ(IPCC_C1_RX_IRQn);
    __DSB();
    __ISB();
    #endif

    // Drain any queued RX buffers to prevent net_buf leaks
    struct net_buf *buf;
    while ((buf = rx_queue_get()) != NULL) {
        net_buf_unref(buf);
    }
    rx_queue_head = 0;
    rx_queue_tail = 0;

    // Clear any partial H:4 parse state
    mp_bluetooth_zephyr_h4_reset();

    // Clean up shared soft timer and sched_node
    mp_bluetooth_zephyr_poll_cleanup();

    // Reset GATT memory pool for next init cycle (if using bump allocator)
    #if MICROPY_BLUETOOTH_ZEPHYR_GATT_POOL
    mp_bluetooth_zephyr_gatt_pool_reset();
    #endif
}

// ============================================================================
// Simple bump allocator for GATT structures (malloc/free shims)
// ============================================================================
// Zephyr BLE GATT requires memory that persists outside the GC heap.
// This provides minimal malloc/free using a static pool. Memory is only
// truly freed on BLE deinit (gatt_pool_reset).

