andrewleech/micropython/ports/stm32/mpzephyrport.c
#define GATT_POOL_SIZE 4096  // 4KB for GATT services/attributes

static uint8_t gatt_pool[GATT_POOL_SIZE];
static size_t gatt_pool_offset = 0;

// Simple allocation tracking for free() support
#define MAX_GATT_ALLOCS 64
static struct {
    void *ptr;
    size_t size;
} gatt_alloc_table[MAX_GATT_ALLOCS];
static int gatt_alloc_count = 0;

void *malloc(size_t size) {
    // Align to 4 bytes
    size = (size + 3) & ~3;

    if (gatt_pool_offset + size > GATT_POOL_SIZE) {
        error_printf("GATT pool exhausted (need %u, have %u)\n",
            (unsigned)size, (unsigned)(GATT_POOL_SIZE - gatt_pool_offset));
        return NULL;
    }

    void *ptr = &gatt_pool[gatt_pool_offset];
    gatt_pool_offset += size;

    // Track allocation for potential free()
    if (gatt_alloc_count < MAX_GATT_ALLOCS) {
        gatt_alloc_table[gatt_alloc_count].ptr = ptr;
        gatt_alloc_table[gatt_alloc_count].size = size;
        gatt_alloc_count++;
    }

    return ptr;
}

void free(void *ptr) {
    // In this bump allocator, individual frees don't reclaim memory.
    // Memory is only reclaimed on pool reset (BLE deinit).
    // We just mark the entry as freed for debugging.
    if (ptr == NULL) {
        return;
    }

    for (int i = 0; i < gatt_alloc_count; i++) {
        if (gatt_alloc_table[i].ptr == ptr) {
            gatt_alloc_table[i].ptr = NULL;  // Mark as freed
            return;
        }
    }
}

// Called during BLE deinit to reset the pool for next init cycle
void mp_bluetooth_zephyr_gatt_pool_reset(void) {
    gatt_pool_offset = 0;
    gatt_alloc_count = 0;
}

#endif // MICROPY_PY_BLUETOOTH && MICROPY_BLUETOOTH_ZEPHYR
